app/views/landing/land.html.erb

<div class="container">
  <% total_classes = Student.maximum('class_number') %>
---
SELECT "students".* FROM "students" WHERE (class_number = '1')
SELECT MAX("students"."class_number") FROM "students"

            <option>All</option>
            <% newest_pair = Pair.where(:class_number => cookies[:visibleClass]).maximum('pair_set') %>
---
SELECT "pairs".* FROM "pairs" WHERE (class_number = '1')
SELECT MAX("pairs"."pair_set") FROM "pairs" WHERE "pairs"."class_number" = $1  [["class_number", 1]]