app/controllers/display_controller.rb

SELECT "students".* FROM "students" WHERE "students"."class_number" = $1  [["class_number", 1]]
SELECT COUNT(*) FROM "students" WHERE "students"."class_number" = $1  [["class_number", 1]]
INSERT INTO "pairs" ("class_number", "pair_set", "first_id", "second_id", "first_full_name", "second_full_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 96]]
---
  def pair
    @students_to_pair = Student.where(class_number: cookies[:seeClass])
    if enough_pairs && !cookies[:seeClass].blank? && (@students_to_pair.count)%2 == 0
      @student_ids = []
      @pair_results = []
      if !@students_to_pair.nil?
        @students_to_pair.each {|student|
          @student_ids << student.id
        }
      end
      @pairs_bad = true
      while @pairs_bad
        @pairs_bad = false
        randomized_ids = form_pairs
      end

      randomized_ids.each {|count|
        @pair_results << "#{Student.find(count).first_name} #{Student.find(count).last_name}"