app/controllers/manager_controller.rb

INSERT INTO "students" ("first_name", "last_name", "class_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Mike"], ["last_name", "Guerrero"], ["class_number", 1], ["created_at", "2016-06-17 16:03:44.862652"], ["updated_at", "2016-06-17 16:03:44.862652"]]
---
  def add_student
    if !params[:firstName].blank? && !params[:lastName].blank? &&
      new_student = Student.new
      new_student.first_name = params[:firstName].strip.capitalize
      new_student.last_name = params[:lastName].strip.capitalize
      new_student.class_number = params[:classNumber]
      new_student.save

SELECT  "students".* FROM "students" WHERE "students"."first_name" = $1 AND "students"."last_name" = $2 LIMIT 1  [["first_name", "Mike"], ["last_name", "Guerrero"]]
SELECT "pairs".* FROM "pairs" WHERE "pairs"."first_id" = $1  [["first_id", 58]]
SELECT "pairs".* FROM "pairs" WHERE "pairs"."second_id" = $1  [["second_id", 58]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 46]]
---
  def delete
    student_to_delete = Student.find_by_first_name_and_last_name(params[:displayedFirstName], params[:displayedLastName])
    first_pairs_to_delete = Pair.where(:first_id => student_to_delete.id)
    second_pairs_to_delete = Pair.where(:second_id => student_to_delete.id)

    first_pairs_to_delete.each do |num|
      num.destroy
    end
    second_pairs_to_delete.each do |num|
      num.destroy
    end
    student_to_delete.destroy

SELECT  "pairs".* FROM "pairs" WHERE "pairs"."first_id" = $1 AND "pairs"."second_id" = $2 LIMIT 1  [["first_id", 3], ["second_id", 17]]
DELETE FROM "pairs" WHERE "pairs"."id" = $1  [["id", 1]]
---
  def delete_pair
    @delete_this = Pair.find_by_first_id_and_second_id(params[:displayedFirstId], params[:displayedSecondId])
    @delete_this.destroy